Autodesk.Revit.DB.Structure.FabricWireItem.Create(System.Double,System.Double,Autodesk.Revit.DB.ElementId,System.Double)
Creates a new instance of a single Fabric wire.
distance:
The distance between this wire and the next wire in the Custom Fabric Sheet
wireLength:
Length of this wire
wireType:
The wire type of this wire
wireOffset:
The offset between two wires in the same line
Returns:
The newly created Fabric wire instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for distance is not a number
-or-
The given value for wireLength is not a number
-or-
wireType is not a valid Element identifier.
-or-
The given value for wireOffset is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distance must be between 0 and 30000 feet.
-or-
The given value for wireLength must be greater than 0 and no more than 30000 feet.
-or-
The given value for wireOffset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.FabricWireItem.WireType
The wire type of this wire item
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: wireType is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017